


# 파이썬에서 문자 표현
# " ", '', 모두 사용 가능
name = "이서희"
name = '이서희'

# 컴퓨터가 값을 저장할 때 무슨 타입 확인
# type(변수) 괄호안에 변수가 무슨 타입! 형태!

result = type(name)
print(result)

# 파이썬 문자를 여러 개 줄에 저장 가능
str1 = """
    오늘 한잔해야지!
"""
print(str1)
str2 = '''
    오늘은 집에 빨리 가자!
'''
print(str2)

age = 10
print("이름이", name, "나이는", age, "세", sep="")
print("이름이", name, "나이는", age, "세", sep="@")
print("이름이", name, "나이는", age, "세", sep="!")
print("이름이", name, "나이는", age, "세", sep="*")

# 문자열 포맷팅 (f-string) : 문자 안에 변수를 집어 넣을 수 있다.
print(f"이름은 {name} 이고, 나이는 {age}")

# 문자랑 숫자 절떄 더하기 안됨!
# str(변수), 숫자를 문자로 변경할 때 사용하는 str()
print(name + str(age) + "세")

# 평균을 계싼하고 출력하는 프로그램!
# 1. 점수를 입력받는다.
# 국어 = int(input("숫자를 입력하세요."))
# 수학 = int(input("숫자를 입력하세요."))
# 영어 = int(input("숫자를 입력하세요."))

# 2. 더하기
# result = 국어 + 수학 + 영어

# # 나누기 
# sum = result / 3

# # 결과 출력
# print(f"평균{sum}")

# # 자리수를 지정하는 형식
# # {평균:.3f} - 평균값을 출력할 때 소수점 자리를 정한다는 뜻 (3개까지)
# print(f"평균: {sum:.3f}")

# 쇼핑몰 금액 출력 천단위로, 붙는 것 !
price = 12900
price2= 200000
print("현재 총금액: ", price)
print(f"현재 총금액: {price}")
print(f"현재 총금액: {price :,} 원")
print(f"현재 총금액: {price2 :,} 원")

# .1%
# : 출력할 때 모양 지정
# .1 - 소수점 아래 1자리
# % - 100을 곱해서 백분율 표시하고 % 로 붙인다.



# 반복문이란?
# 동작하는 방법, 왜 쓰는지, 