# 이상, 이하, 미만, 초과
# 놀이동산 놀이기구 탑승 제한
# 키가 140 이상이면 탑승

키 = 160.12

print(키 >= 140)
print(키 <= 140)
print(키 != 140)

# 1) 편의점 신라면 1800, 핫바 1500
# 총 합을 구하는 변수 만들어 저장
# 결과 출력
# 총 결제할 금액 : 3300원

noodel = 1800
bar = 1500
sum = noodel + bar
print(sum)

# 2) 나머지값,몫 나눗셈!
# 가진 돈 10000원
# 거스름돈 (500원 100원) 지폐 x
# 결과  500원 개수 : **원, 100원 개수 : **원

가진돈 = 10000
거스름돈 = 가진돈 - sum
거스름돈_500 =  거스름돈 // 500
거스름돈_100 =  (거스름돈 % 500) // 100
print("500원 개수:", 거스름돈_500,", 100원 개수: ", 거스름돈_100)

